In [1]:
import pandas as pd

### Import CSV file

In [2]:
df = pd.read_csv('countries.csv')

In [3]:
df.shape

(5, 5)

In [4]:
df.head()

       Name     People     Area   BIP Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [5]:
df['Name'].min()

'Brazilia'

In [6]:
df['Name'].max()

'Japan'

In [7]:
df['People'].min()

36503097

In [8]:
df['People'].max()

208360000

In [9]:
df['People'].mean()

102786293.6

In [10]:
df['BIP'].min()

1529

In [11]:
df['BIP'].max()

4938

In [12]:
df['BIP'].mean()

2716.2

In [13]:
df['Currency'].min()

'CAD'

In [14]:
df['Currency'].max()

'YEN'

### Last 4 rows

In [15]:
df.tail(4)

       Name     People     Area   BIP Currency
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

### Countries who have "EUR" as currency

In [16]:
df.loc[df['Currency'] == "EUR"]

      Name    People    Area   BIP Currency
0  Germany  82521653  357385  3466      EUR
3    Italy  60501718  301338  1850      EUR

### "Name" and "Currency" in a new data frame

In [17]:
df[['Name', 'Currency']]

       Name Currency
0   Germany      EUR
1     Japan      YEN
2    Canada      CAD
3     Italy      EUR
4  Brazilia     REAL

### Countries that have more than 2000 BIP

In [18]:
df.loc[df['BIP'] > 2000]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN

###  All countries with inhabitants between 50 and 150 Mio

In [19]:
df.loc[(df['People'] > 50000000) & (df['People'] < 150000000)]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN
3    Italy   60501718  301338  1850      EUR

### Changing the column name "BIP" to "Bip

In [20]:
df.columns = ['Name','People','Area','Bip','Currency']

In [21]:
df.head()

       Name     People     Area   Bip Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

### "Bip" sum

In [22]:
df['Bip'].sum()

13581

### Average people of all countries

In [23]:
df['People'].mean()

102786293.6

### Sort by "Name"

In [24]:
df.sort_values('Name')

       Name     People     Area   Bip Currency
4  Brazilia  208360000  8515770  1798     REAL
2    Canada   36503097  9984670  1529      CAD
0   Germany   82521653   357385  3466      EUR
3     Italy   60501718   301338  1850      EUR
1     Japan  126045000   377835  4938      YEN

### Create a new data frame from the original where the area is changed as follows: all countries with > 1000000 get "BIG" and <= 1000000 get "SMALL" in the cell replaced.

In [26]:
import numpy as np
df_area_cat = df.copy()
df_area_cat['Area'] = np.where(df_area_cat['Area'] <= 1000000, 'SMALL', 'BIG')
df_area_cat

       Name     People   Area   Bip Currency
0   Germany   82521653  SMALL  3466      EUR
1     Japan  126045000  SMALL  4938      YEN
2    Canada   36503097    BIG  1529      CAD
3     Italy   60501718  SMALL  1850      EUR
4  Brazilia  208360000    BIG  1798     REAL